____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
hero_input (InputLayer)          (None, 520)           0                                            
____________________________________________________________________________________________________
reshape_9 (Reshape)              (None, 1, 2, 260)     0           hero_input[0][0]                 
____________________________________________________________________________________________________
permute_9 (Permute)              (None, 2, 260, 1)     0           reshape_9[0][0]                  
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 2, 1, 135)     35235       permute_9[0][0]                  
____________________________________________________________________________________________________
elu_17 (ELU)                     (None, 2, 1, 135)     0           convolution2d_17[0][0]           
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 2, 1, 64)      8704        elu_17[0][0]                     
____________________________________________________________________________________________________
elu_18 (ELU)                     (None, 2, 1, 64)      0           convolution2d_18[0][0]           
____________________________________________________________________________________________________
flatten_9 (Flatten)              (None, 128)           0           elu_18[0][0]                     
____________________________________________________________________________________________________
dense_28 (Dense)                 (None, 128)           16512       flatten_9[0][0]                  
____________________________________________________________________________________________________
batchnormalization_25 (BatchNorm (None, 128)           512         dense_28[0][0]                   
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 128)           0           batchnormalization_25[0][0]      
____________________________________________________________________________________________________
dropout_25 (Dropout)             (None, 128)           0           activation_26[0][0]              
____________________________________________________________________________________________________
dense_29 (Dense)                 (None, 128)           16512       dropout_25[0][0]                 
____________________________________________________________________________________________________
batchnormalization_26 (BatchNorm (None, 128)           512         dense_29[0][0]                   
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 128)           0           batchnormalization_26[0][0]      
____________________________________________________________________________________________________
dropout_26 (Dropout)             (None, 128)           0           activation_27[0][0]              
____________________________________________________________________________________________________
dense_30 (Dense)                 (None, 128)           16512       dropout_26[0][0]                 
____________________________________________________________________________________________________
batchnormalization_27 (BatchNorm (None, 128)           512         dense_30[0][0]                   
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 128)           0           batchnormalization_27[0][0]      
____________________________________________________________________________________________________
dropout_27 (Dropout)             (None, 128)           0           activation_28[0][0]              
____________________________________________________________________________________________________
out_winner (Dense)               (None, 2)             258         dropout_27[0][0]                 
____________________________________________________________________________________________________
out_concede (Dense)              (None, 1)             129         dropout_27[0][0]                 
____________________________________________________________________________________________________
out_secs (Dense)                 (None, 1)             129         dropout_27[0][0]                 
====================================================================================================
Total params: 95,527
Trainable params: 94,759
Non-trainable params: 768
____________________________________________________________________________________________________