{"class_name": "Model", "config": {"output_layers": [["out_winner", 0, 0], ["out_concede", 0, 0], ["out_secs", 0, 0]], "input_layers": [["hero_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "hero_input", "input_dtype": "float32", "batch_input_shape": [null, 520]}, "name": "hero_input", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_1", "input_dtype": "float32", "batch_input_shape": [null, 520], "trainable": true, "target_shape": [1, 2, 260]}, "name": "reshape_1", "inbound_nodes": [[["hero_input", 0, 0]]]}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_1"}, "name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 135, "name": "convolution2d_1", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 260, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [1, 1]}, "name": "convolution2d_1", "inbound_nodes": [[["permute_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_1", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true}, "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "convolution2d_2", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_row": 1, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [1, 1]}, "name": "convolution2d_2", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_2", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true}, "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "linear", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_3", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true}, "name": "batchnormalization_3", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "linear", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_4", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true}, "name": "batchnormalization_4", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "output_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "linear", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_5", "axis": -1, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true}, "name": "batchnormalization_5", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "out_winner", "output_dim": 2, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "softmax", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "out_winner", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "out_concede", "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "sigmoid", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "out_concede", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "Dense", "config": {"name": "out_secs", "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 128, "activation": "linear", "input_dtype": "float32", "batch_input_shape": [null, 128], "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}, "name": "out_secs", "inbound_nodes": [[["dropout_3", 0, 0]]]}]}, "keras_version": "1.2.1"}