____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
hero_input (InputLayer)          (None, 520)           0                                            
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 1, 2, 260)     0           hero_input[0][0]                 
____________________________________________________________________________________________________
permute_1 (Permute)              (None, 2, 260, 1)     0           reshape_1[0][0]                  
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 2, 1, 135)     35235       permute_1[0][0]                  
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 2, 1, 135)     540         convolution2d_1[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 2, 1, 135)     0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 2, 1, 64)      8704        activation_1[0][0]               
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 2, 1, 64)      256         convolution2d_2[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 2, 1, 64)      0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 128)           0           activation_2[0][0]               
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 128)           16512       flatten_1[0][0]                  
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 128)           512         dense_1[0][0]                    
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 128)           0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 128)           0           activation_3[0][0]               
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 128)           16512       dropout_1[0][0]                  
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 128)           512         dense_2[0][0]                    
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 128)           0           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 128)           0           activation_4[0][0]               
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 128)           16512       dropout_2[0][0]                  
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 128)           512         dense_3[0][0]                    
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 128)           0           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 128)           0           activation_5[0][0]               
____________________________________________________________________________________________________
out_winner (Dense)               (None, 2)             258         dropout_3[0][0]                  
____________________________________________________________________________________________________
out_concede (Dense)              (None, 1)             129         dropout_3[0][0]                  
____________________________________________________________________________________________________
out_secs (Dense)                 (None, 1)             129         dropout_3[0][0]                  
====================================================================================================
Total params: 96,323
Trainable params: 95,157
Non-trainable params: 1,166
____________________________________________________________________________________________________