{"class_name": "Model", "keras_version": "1.2.1", "config": {"name": "model_6", "input_layers": [["hero_input", 0, 0]], "output_layers": [["out_winner", 0, 0], ["out_concede", 0, 0], ["out_secs", 0, 0]], "layers": [{"name": "hero_input", "class_name": "InputLayer", "config": {"name": "hero_input", "batch_input_shape": [null, 520], "input_dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "target_shape": [1, 2, 260], "input_dtype": "float32", "batch_input_shape": [null, 520], "trainable": true}, "inbound_nodes": [[["hero_input", 0, 0]]]}, {"name": "permute_9", "class_name": "Permute", "config": {"name": "permute_9", "trainable": true, "dims": [2, 3, 1]}, "inbound_nodes": [[["reshape_9", 0, 0]]]}, {"name": "convolution2d_17", "class_name": "Convolution2D", "config": {"name": "convolution2d_17", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 260, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 1, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "bias": true, "nb_filter": 135, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["permute_9", 0, 0]]]}, {"name": "elu_17", "class_name": "ELU", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"name": "convolution2d_18", "class_name": "Convolution2D", "config": {"name": "convolution2d_18", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 1, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 1, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "bias": true, "nb_filter": 64, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["elu_17", 0, 0]]]}, {"name": "elu_18", "class_name": "ELU", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"name": "flatten_9", "class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true}, "inbound_nodes": [[["elu_18", 0, 0]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 128, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"name": "batchnormalization_25", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_25", "trainable": true, "momentum": 0.99, "mode": 0, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "inbound_nodes": [[["dense_28", 0, 0]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_25", 0, 0]]]}, {"name": "dropout_25", "class_name": "Dropout", "config": {"name": "dropout_25", "p": 0.5, "trainable": true}, "inbound_nodes": [[["activation_26", 0, 0]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 128, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["dropout_25", 0, 0]]]}, {"name": "batchnormalization_26", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_26", "trainable": true, "momentum": 0.99, "mode": 0, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "inbound_nodes": [[["dense_29", 0, 0]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_26", 0, 0]]]}, {"name": "dropout_26", "class_name": "Dropout", "config": {"name": "dropout_26", "p": 0.5, "trainable": true}, "inbound_nodes": [[["activation_27", 0, 0]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 128, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["dropout_26", 0, 0]]]}, {"name": "batchnormalization_27", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_27", "trainable": true, "momentum": 0.99, "mode": 0, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "inbound_nodes": [[["dense_30", 0, 0]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_27", 0, 0]]]}, {"name": "dropout_27", "class_name": "Dropout", "config": {"name": "dropout_27", "p": 0.5, "trainable": true}, "inbound_nodes": [[["activation_28", 0, 0]]]}, {"name": "out_winner", "class_name": "Dense", "config": {"name": "out_winner", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 2, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "softmax", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["dropout_27", 0, 0]]]}, {"name": "out_concede", "class_name": "Dense", "config": {"name": "out_concede", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 1, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "sigmoid", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["dropout_27", 0, 0]]]}, {"name": "out_secs", "class_name": "Dense", "config": {"name": "out_secs", "activity_regularizer": null, "W_regularizer": null, "input_dim": 128, "output_dim": 1, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 128], "trainable": true}, "inbound_nodes": [[["dropout_27", 0, 0]]]}]}}